Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
940679572:workgroup/query_workgroup",
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-users-info",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:496940679572:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*",
              + "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250804065616486200000003",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::pgxflow-backend-20250804065616486200000003/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-generateReports",
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dataportal-locks-access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "dataportal-locks-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-mutex-locks",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-quota-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-quota-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.extra-glue-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-glue-policy-document" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetBucketAcl",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListAllMyBuckets",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-metadata20250519061956402900000002",
              + "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-deidentifyFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-deidentifyFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:HeadObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/staging/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::496940679572:role/sbeacon_backend_ec2_deidentification_instance_role",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-generateReports will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-generateReports" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/clinical-workflows/*/reports/*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getAnalyses will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getAnalyses" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getBiosamples will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getBiosamples" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getDatasets will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getDatasets" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getGenomicVariants will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:performQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_deployment.BeaconApi must be replaced
+/- resource "aws_api_gateway_deployment" "BeaconApi" {
      ~ created_date = "2025-08-04T08:02:47Z" -> (known after apply)
      ~ id           = "kunsoa" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "c8004812089440a606826280d5edfc271e901df7"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.admin_proxy will be updated in-place
  ~ resource "aws_api_gateway_integration" "admin_proxy" {
        id                      = "agi-q5k7basu44-2quj81-ANY"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-admin/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses" {
        id                      = "agi-q5k7basu44-j8mlzx-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-filtering_terms" {
        id                      = "agi-q5k7basu44-iltxhj-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-filtering_terms_post" {
        id                      = "agi-q5k7basu44-iltxhj-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-id" {
        id                      = "agi-q5k7basu44-ka8qbl-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-id-g_variants" {
        id                      = "agi-q5k7basu44-ako1ij-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-id-g_variants_post" {
        id                      = "agi-q5k7basu44-ako1ij-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses-id_post" {
        id                      = "agi-q5k7basu44-ka8qbl-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.analyses_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "analyses_post" {
        id                      = "agi-q5k7basu44-j8mlzx-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getAnalyses/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples" {
        id                      = "agi-q5k7basu44-5l0now-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-filtering_terms" {
        id                      = "agi-q5k7basu44-6cnxhw-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-filtering_terms_post" {
        id                      = "agi-q5k7basu44-6cnxhw-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id" {
        id                      = "agi-q5k7basu44-b5s2mr-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-analyses" {
        id                      = "agi-q5k7basu44-93fyd7-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-analyses_post" {
        id                      = "agi-q5k7basu44-93fyd7-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-g_variants" {
        id                      = "agi-q5k7basu44-kzwrfw-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-g_variants_post" {
        id                      = "agi-q5k7basu44-kzwrfw-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-runs" {
        id                      = "agi-q5k7basu44-a3h38f-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id-runs_post" {
        id                      = "agi-q5k7basu44-a3h38f-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples-id_post" {
        id                      = "agi-q5k7basu44-b5s2mr-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.biosamples_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "biosamples_post" {
        id                      = "agi-q5k7basu44-5l0now-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getBiosamples/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.configuration will be updated in-place
  ~ resource "aws_api_gateway_integration" "configuration" {
        id                      = "agi-q5k7basu44-23d5cd-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getConfiguration/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets" {
        id                      = "agi-q5k7basu44-e1siuc-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-filtering_terms" {
        id                      = "agi-q5k7basu44-tbdlai-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-filtering_terms_post" {
        id                      = "agi-q5k7basu44-tbdlai-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id" {
        id                      = "agi-q5k7basu44-1f9qi6-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-biosamples" {
        id                      = "agi-q5k7basu44-m7cdum-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-biosamples_post" {
        id                      = "agi-q5k7basu44-m7cdum-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-filtering_terms" {
        id                      = "agi-q5k7basu44-44hcx4-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-filtering_terms_post" {
        id                      = "agi-q5k7basu44-44hcx4-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-g_variants" {
        id                      = "agi-q5k7basu44-347vaj-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-g_variants_post" {
        id                      = "agi-q5k7basu44-347vaj-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-individuals" {
        id                      = "agi-q5k7basu44-8staf5-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id-individuals_post" {
        id                      = "agi-q5k7basu44-8staf5-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets-id_post" {
        id                      = "agi-q5k7basu44-1f9qi6-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.datasets_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "datasets_post" {
        id                      = "agi-q5k7basu44-e1siuc-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getDatasets/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.dportal_proxy will be updated in-place
  ~ resource "aws_api_gateway_integration" "dportal_proxy" {
        id                      = "agi-q5k7basu44-v34eva-ANY"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-dataPortal/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.entry_types will be updated in-place
  ~ resource "aws_api_gateway_integration" "entry_types" {
        id                      = "agi-q5k7basu44-yqo9d0-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getEntryTypes/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "filtering_terms" {
        id                      = "agi-q5k7basu44-j4lxyc-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getFilteringTerms/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants" {
        id                      = "agi-q5k7basu44-rtn6ve-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id" {
        id                      = "agi-q5k7basu44-9gu35e-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id-biosamples" {
        id                      = "agi-q5k7basu44-cq978v-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id-biosamples_post" {
        id                      = "agi-q5k7basu44-cq978v-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id-individuals" {
        id                      = "agi-q5k7basu44-adicy9-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id-individuals_post" {
        id                      = "agi-q5k7basu44-adicy9-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants-id_post" {
        id                      = "agi-q5k7basu44-9gu35e-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "g_variants_post" {
        id                      = "agi-q5k7basu44-rtn6ve-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getGenomicVariants/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals" {
        id                      = "agi-q5k7basu44-cg58h5-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-filtering_terms" {
        id                      = "agi-q5k7basu44-v71abw-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-filtering_terms_post" {
        id                      = "agi-q5k7basu44-v71abw-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id" {
        id                      = "agi-q5k7basu44-82hpr9-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id-biosamples" {
        id                      = "agi-q5k7basu44-mdkzoq-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id-biosamples_post" {
        id                      = "agi-q5k7basu44-mdkzoq-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id-g_variants" {
        id                      = "agi-q5k7basu44-2ztt52-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id-g_variants_post" {
        id                      = "agi-q5k7basu44-2ztt52-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals-id_post" {
        id                      = "agi-q5k7basu44-82hpr9-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.individuals_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "individuals_post" {
        id                      = "agi-q5k7basu44-cg58h5-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getIndividuals/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.info will be updated in-place
  ~ resource "aws_api_gateway_integration" "info" {
        id                      = "agi-q5k7basu44-057wa0-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.map will be updated in-place
  ~ resource "aws_api_gateway_integration" "map" {
        id                      = "agi-q5k7basu44-8abzz5-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getMap/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.root-get will be updated in-place
  ~ resource "aws_api_gateway_integration" "root-get" {
        id                      = "agi-q5k7basu44-qzkoyr0bte-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getInfo/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs" {
        id                      = "agi-q5k7basu44-x9yetb-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-filtering_terms" {
        id                      = "agi-q5k7basu44-fh7fed-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-filtering_terms_post" {
        id                      = "agi-q5k7basu44-fh7fed-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id" {
        id                      = "agi-q5k7basu44-annyyp-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id-analyses" {
        id                      = "agi-q5k7basu44-tfoc5g-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id-analyses_post" {
        id                      = "agi-q5k7basu44-tfoc5g-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id-g_variants" {
        id                      = "agi-q5k7basu44-8bdpcq-GET"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id-g_variants_post" {
        id                      = "agi-q5k7basu44-8bdpcq-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs-id_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs-id_post" {
        id                      = "agi-q5k7basu44-annyyp-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_integration.runs_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "runs_post" {
        id                      = "agi-q5k7basu44-x9yetb-POST"
      ~ uri                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-getRuns/invocations" -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "BeaconApi" {
        id                           = "q5k7basu44"
        name                         = "sbeacon-backend-api"
      ~ tags                         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
      ~ deployment_id         = "kunsoa" -> (known after apply)
        id                    = "ags-q5k7basu44-prod"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be updated in-place
  ~ resource "aws_athena_workgroup" "sbeacon-workgroup" {
        id            = "query_workgroup"
        name          = "query_workgroup"
      ~ tags          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-index-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms_index"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = jsonencode(
            {
              + Parameters = {
                  + DatabaseName = {
                      + Type = "String"
                    }
                  + TableName    = {
                      + Type = "String"
                    }
                }
              + Resources  = {
                  + SBeaconTermsGlueCatalogTable = {
                      + Properties = {
                          + CatalogId    = {
                              + Ref = "AWS::AccountId"
                            }
                          + DatabaseName = {
                              + Ref = "DatabaseName"
                            }
                          + TableInput   = {
                              + Name              = {
                                  + Ref = "TableName"
                                }
                              + Parameters        = {
                                  + EXTERNAL       = "TRUE"
                                  + numFiles       = "-1"
                                  + "orc.compress" = "SNAPPY"
                                }
                              + PartitionKeys     = [
                                  + {
                                      + Comment = "partition by kind"
                                      + Name    = "kind"
                                      + Type    = "string"
                                    },
                                ]
                              + StorageDescriptor = {
                                  + Columns      = [
                                      + {
                                          + Name = "id"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "term"
                                          + Type = "string"
                                        },
                                      + {
                                          + Name = "_projectname"
                                          + Type = "string"
                                        },
                                    ]
                                  + InputFormat  = "org.apache.hadoop.hive.ql.io.orc.OrcInputFormat"
                                  + Location     = "s3://gaspi-metadata20250519061956402900000002/terms-index"
                                  + OutputFormat = "org.apache.hadoop.hive.ql.io.orc.OrcOutputFormat"
                                  + SerdeInfo    = {
                                      + Name                 = "ORC"
                                      + Parameters           = {
                                          + "hive.orc.use-column-names" = "TRUE"
                                          + "orc.column.index.access"   = "FALSE"
                                          + "serialization.format"      = "1"
                                        }
                                      + SerializationLibrary = "org.apache.hadoop.hive.ql.io.orc.OrcSerde"
                                    }
                                }
                              + TableType         = "EXTERNAL_TABLE"
                            }
                        }
                      + Type       = "AWS::Glue::Table"
                    }
                }
            }
        )
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be created
  + resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
      + id            = (known after apply)
      + name          = "sbeacon-terms-stack"
      + outputs       = (known after apply)
      + parameters    = {
          + "DatabaseName" = "sbeacon_metadata"
          + "TableName"    = "sbeacon_terms"
        }
      + policy_body   = (known after apply)
      + region        = "ap-southeast-3"
      + tags_all      = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + template_body = jsonencode(
            {
              + Parameters = {
                  + DatabaseName = {
                      + Type = "String"
                    }
                  + TableName    = {
                      + Type = "String"
                    }
                }
              + Resources  = {
                  + SBeaconTermsGlueCatalogTable = {
                      + Properties = {
                          + CatalogId    = {
                              + Ref = "AWS::AccountId"
                            }
                          + DatabaseName = {
                              + Ref = "DatabaseName"
                            }
                          + TableInput   = {
                              + Name              = {
                                  + Ref = "TableName"
                                }
                              + Parameters        = {
                                  + EXTERNAL       = "TRUE"
                                  + numFiles       = "-1"
                                  + "orc.compress" = "SNAPPY"
                                }
                              + PartitionKeys     = [
                                  + {
                                      + Comment = "partition by kind"
                                      + Name    = "kind"
                                      + Type    = "string"
                                    },
                                ]
                              + StorageDescriptor = {
                                  + Columns      = [
                                      + {
                                          + Name = "term"
  
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.